import random


def play_guessing_game():
    # задумуємо випадкове число від 1 до 1000
    secret_number = random.randint(1, 1000)
    print("У мене є число між 1 та 1000. Відгадайте і введіть ваше число...")

# виконуємо цикл, доки гравець не відгадає число
    while True:
        # отримуємо введене користувачем число
        user_guess = int(input("Ваше число: "))
# перевіряємо, чи відповідає введене число задуманому
        if user_guess == secret_number:
            print("Чудово! Ви вгадали число!")
            play_again = input("Будете грати далі? (введіть 'так' або 'ні'): ")
            if play_again.lower() == "так":
                # якщо гравець хоче продовжити гру, генеруємо нове випадкове число
                play_guessing_game()
            else:
                # якщо гравець не хоче продовжувати гру, виходимо з циклу
                print("Дякуємо за гру. До побачення!")
                break
        elif user_guess < secret_number:
            print("Занадто мале. Спробуйте ще раз.")
        else:
            print("Занадто велике. Спробуйте ще раз.")


play_guessing_game()
