import datetime

# Словник, де ключ - ім'я та прізвище учня, а значення - дата його народження
students = {
    "Іванов Іван Іванович": (2005, 3, 12),
    "Петров Петро Петрович": (2006, 5, 20),
    "Сидоров Сидір Сидорович": (2005, 4, 8),
    "Коваленко Олександр Миколайович": (2006, 3, 28),
    "Морозова Анна Вікторівна": (2005, 5, 15),
    "Козлов Олег Володимирович": (2006, 4, 3),
    "Біленький Андрій Олександрович": (2005, 4, 20),
    "Грищенко Катерина Олександрівна": (2006, 5, 5),
    "Литвиненко Ілля Олегович": (2005, 3, 30),
    "Бондарчук Максим Вікторович": (2006, 4, 16),
}

# Отримуємо поточну дату
today = datetime.date.today()

# Проходимося по ключах словника та перевіряємо, чи є сьогодні день народження
for name, date_of_birth in students.items():
    year, month, day = date_of_birth
    dob = datetime.date(year, month, day)
    if dob.month == today.month and dob.day == today.day:
        print(name)
